---
kind: method
id: M:Autodesk.Revit.DB.FamilyInstance.HasSweptProfile
zh: 族实例
source: html/dbbd4aa9-720b-3a1c-3085-7b94b6d73b58.htm
---
# Autodesk.Revit.DB.FamilyInstance.HasSweptProfile Method

**中文**: 族实例

Indicates if this instance can be represented as a swept profile.

## Syntax (C#)
```csharp
public bool HasSweptProfile()
```

## Returns
True if the instance can be represented as a swept profile, false otherwise.